# DimLeaderShoulderLength Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..DimLeaderShoulderLength Property
ParameterTypeId Class See Also
---
"Shoulder Length"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId DimLeaderShoulderLength { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property DimLeaderShoulderLength As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ DimLeaderShoulderLength {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace